Revit 2027 API
AnalyticalLinkType.IsValidAnalyticalFixityState Method
 Returns whether the input fixity state is valid for Analytical Link Type parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidAnalyticalFixityState(
	AnalyticalFixityState fixityState
)
Public Shared Function IsValidAnalyticalFixityState (
	fixityState As AnalyticalFixityState
) As Boolean
public:
static bool IsValidAnalyticalFixityState(
	AnalyticalFixityState fixityState
)
static member IsValidAnalyticalFixityState :
        fixityState : AnalyticalFixityState -> bool
Parameters
fixityState AnalyticalFixityState
 The fixity state value to check.
Return Value
Boolean
 True if valid.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AnalyticalLinkType Class
Autodesk.Revit.DB.Structure Namespace